Repository: gph4ppy/SaveMe
Catalog: SaveMeSwiftUI/SaveMeSwiftUI/Resources/*.lproj/Localizable.strings
Languages: pl

source: Hello
pl: Hej

source: Save
pl: Zapisz

source: Write
pl: Napisz

source: Copy
pl: Kopiuj

source: Add
pl: Dodaj

source: Delete
pl: Usuń

source: Cancel
pl: Anuluj

source: Select Date
pl: Wybierz datę

source: Browse History
pl: Przeglądaj historię

# select_date_info
source: Select date in the Date Picker above to view moods in selected date
pl: Wybierz datę powyżej, aby zobaczyć humory z tego dnia.

# no_data_moods
source: There is no data here. :( Add your current mood!
pl: Brak danych. :( Dodaj swój aktualny humor!

# mood_title
source: How do you feel?
pl: Jak się czujesz?

# no_data_diary
source: There is no data here. :( Write some cards!
pl: Brak danych. :( Napisz kartkę!

# diary_title
source: Diary
pl: Pamiętnik

# no_data_thinking
source: You're a wonderful person. Add cards that will remind you of this when you feel worse. Some ideas: - It's all happening in my head. - I don't like everyone, so why do I expect everyone to like me? - Everyone makes mistakes. - People forget awkward situations after 5 minutes. - For one mistake, people won't change their mind about me.
pl: Jesteś wspaniałą osobą. Dodaj karty, które przypomną Ci o tym w trakcie gorszego samopoczucia. Kilka pomysłów: - To wszystko dzieje się w mojej głowie. - Nie lubię wszystkich, więc czemu wszyscy mają lubić mnie? - Każdy popełnia błędy. - Ludzie zapominają o niezręcznych sytuacjach po 5 minutach. - Za jeden błąd ludzie nie zmienią o mnie zdania.

# thinking_title
source: Self-esteem
pl: Samoocena

# new_card
source: Add New Card
pl: Nowa karta

# empty_card_title
source: Why is your card empty?
pl: Czemu Twoja karta jest pusta?

# empty_card_body
source: You are valuable, so your card should also have some value.
pl: Jesteś wartościowy, więc Twoja karta również powinna posiadać wartość.

# empty_card_button
source: Got it!
pl: Zrozumiano!

# no_data_dreams
source: There is no data here. :( Write some dreams!
pl: Brak danych. :( Opisz swoje sny!

source: Copy date
pl: Kopiuj datę

source: Copy content
pl: Kopiuj zawartość

# dreamcatcher_title
source: Dreamcatcher
pl: Dziennik snów

# no_data_feelings
source: There is no data here. :( Write some feelings!
pl: Brak danych. :( Dodaj swoje uczucia!

# feelings_title
source: Why I feel like that?
pl: Czemu się tak czuję?

# feelings_alert_title
source: How do you feel?
pl: Jak się czujesz?

# feelings_alert_body
source: Your feelings are now
pl: Twoje uczucia teraz są

source: Positive
pl: Pozytywne

source: Negative
pl: Negatywne

# positive_feelings
source: 🟢 I feel now: 🟢 The reason is: 🟢 What led to this: 🟢 Do I want this feeling to occur more often: 🟢 If so, how can I feel it more often: 🟢 What things or people helped me with this:
pl: 🟢 Czuję się teraz: 🟢 Powodem jest: 🟢 Doprowadziło do tego: 🟢 Czy chcę częściej tak się czuć: 🟢 Jeśli tak, jak mogę czuć to częściej: 🟢 Co lub kto pomógł mi to osiągnąć:

# negative_feelings
source: 🔴 I feel now: 🔴 The reason is: 🔴 What led to this: 🔴 What are the pros of this situation: 🔴 What are the cons to this situation: 🔴 How can I prevent it: 🔴 Will the situation repeat itself: 🔴 If so, how can I deal with it:
pl: 🔴 Czuję teraz: 🔴 Powodem jest: 🔴 Doprowadziło do tego: 🔴 Jakie są plusy tej sytuacji: 🔴 Jakie są minusy tej sytuacji: 🔴 Jak mogę temu zapobiec: 🔴 Czy sytuacja się powtórzy: 🔴 Jeśli tak, jak mogę sobie z tym poradzić:

# no_data_things
source: In one day, a lot of good things happen that you don't notice. Whenever something good happens to you, add it here. Even the smallest things count. You haven't typed any good things today.
pl: W ciągu jednego dnia dzieje się sporo pozytywnych rzeczy, których nie dostrzegasz. Kiedy wydarzy się coś dobrego, zapisz to tutaj. Nawet najmniejsze rzeczy się liczą. Dzisiaj nie dodałeś żadnych fajnych rzeczy.

source: Add positive thing
pl: Dodaj pozytywną rzecz

# things_title
source: Positive Things
pl: Pozytywne rzeczy

# settings_title
source: Settings
pl: Ustawienia

source: Current name
pl: Aktualny nick

source: Save Profile Picture
pl: Zapisz zdjęcie profilowe

# app_settings_header
source: App Settings
pl: Ustawienia Aplikacji

# app_info_header
source: App Informations
pl: Informacje o aplikacji

# select_accent_color
source: Accent Color
pl: Motyw

# select_language
source: Language
pl: Język

# select_theme
source: Dark Mode
pl: Tryb ciemny

# setup_notifications
source: Notifications
pl: Powiadomienia

# app_info_version
source: Version
pl: Wersja

# setup_notifications_title
source: Setup notifications
pl: Powiadomienia

source: Select hour
pl: Wybierz godzinę

# allow_notifications
source: 1. Allow notifications.
pl: 1. Zezwól na powiadomienia.

# schedule_notifications
source: 2. Schedule notification.
pl: 2. Zaplanuj powiadomienia.

# notification_title
source: Don't forget about your mental health!
pl: Nie zapominaj o swoim zdrowiu psychicznym!

# notification_body
source: Fill in all the details about today.
pl: Wpisz wszystkie informacje na temat dzisiejszego dnia.

source: Default
pl: Domyślny

source: Blue
pl: Niebieski

source: Pink
pl: Różowy

source: Red
pl: Czerwony

source: Purple
pl: Fioletowy

source: Yellow
pl: Żółty

# welcome_title
source: Welcome in SaveMe!
pl: Witaj w SaveMe!

# welcome_subheadline
source: Your personal psychic health tracker
pl: Osobistym monitorze zdrowia psychicznego

# question_name
source: What's your name?
pl: Jak się nazywasz?

# name_answer
source: My name is...
pl: Mam na imię...

# welcome_footer
source: 1. Your data is not shared with me. I cannot see who is using the application and the data entered. Your name and data remain in the application on your device. 2. This application is not intended to collect medical data. It is not intended to cure mental illness, depression, etc. It has nothing to do with medicine. The app is designed to save data only, just like a notepad - it can be your personal journal with different options. I am not legally responsible for the incorrect use of the application.
pl: 1. Twoje dane nie są mi udostępniane. Nie mogę zobaczyć kto używa aplikacji oraz nie mam dostępu do wprowadzonych informacji. Twoje dane pozostają jedynie na Twoim urządzeniu. 2. Ta aplikacja nie powstała w celach medycznych. Nie służy do leczenia zaburzeń psychicznych, depresji, itp. Nie ma nic wspólnego z medycyną. Aplikacja służy do zapisywania danych, tak jak notatnik - może być Twoim osobistym dziennikiem z różnymi opcjami. Nie ponoszę odpowiedzialności prawnej za nieprawidłowe korzystanie z aplikacji.

# about_title
source: About
pl: O aplikacji

# about_body
source: My name is Jakub and I am the creator of the SaveMe application. This is a project that I found necessary, as many people ask themselves: "Why do I feel like that?", "What can I do with it?" - they try to understand themselves, which is very difficult. It started from the moment when I was looking for an application for myself that would be free and at the same time contain everything I needed. I know programmers need to earn money, but I hate subscribing - I think I'd rather pay once, more than for subscription, and make sure I don't have to worry about taking money from my account at an inopportune moment. This application is not a replacement for professional help - let it be an electronic diary that may help you. I am not legally responsible for improper use of the application and any damage that someone may cause to himself or others. SaveMe is not a medical application - in case of mental disorders, visit a specialist who is a wonderful person and will try to help. You can also call the helpline where you can also find help. Good luck and enjoy using the app!
pl: Nazywam się Jakub i jestem twórcą aplikacji SaveMe. Jest to projekt, który uznałem za potrzebny, gdyż wiele osób zadaje sobie pytanie: "Czemu tak się czuję?", "Co mogę z tym zrobić?" - próbują zrozumieć siebie, co jest bardzo trudne. Zaczęło się od momentu, gdzie szukałem aplikacji dla siebie, która byłaby darmowa, a jednocześnie zawierałaby wszystko, co było mi potrzebne. Wiem, że programiści muszą zarabiać, jednak nienawidzę subskrypcji - jestem zdania, że wolałbym zapłacić raz, więcej niż za subskrypcję i mieć pewność, że nie będę musiał się martwić o to, że kiedyś mi pobierze w nieodpowiednim momencie pieniądze z konta. Aplikacja ta nie jest zamiennikiem profesjonalnej pomocy - niech to będzie elektroniczny dziennik, który może Ci pomóc. Nie odpowiadam prawnie za nieprawidłowe korzystanie z aplikacji oraz szkody, które ktoś może wyrządzić sobie lub innym. SaveMe nie jest aplikacją medyczną - w celu leczenia zaburzeń psychicznych odwiedź specjalistę, który jest wspaniałym człowiekiem i będzie starał się pomóc. Możesz również zadzwonić na telefon zaufania, gdzie również możesz odnaleźć pomoc. Powodzenia i miłego korzystania z aplikacji!

# author_info
source: -year-old creator of the SaveMe app, hobbyist Swift Developer.
pl: -letni twórca aplikacji SaveMe, hobbystyczny programista Swift

# tutorial_swipe
source: Swipe left to see the previous tip, swipe right to see the next tip. You can also wait 5 seconds.
pl: Przewiń w lewo, aby zobaczyć poprzednią wskazówkę, Przewiń w prawo, aby zobaczyć następną wskazówkę. Możesz również poczekać 5 sekund.

# tutorial_delete_title
source: Delete data
pl: Usuwaj dane

# tutorial_delete_body
source: Swipe left to remove data.
pl: Przewiń w lewo, aby usunąć dane.

# tutorial_hold_title
source: Hold for more
pl: Przytrzymaj

# tutorial_hold_body
source: Hold to use more options.
pl: Przytrzymaj, aby ujrzeć więcej opcji.
